import datetime
import numpy as np


class Subway:
    subway_1 = {'罗湖站': '22:00', '国贸站': '22:02', '老街': '22:03', '大剧院': '22:06', '科学馆站': '22:08',
                '华强路站': '22:10', '岗厦站': '22:13', '会展中心站': '22:14', '购物公园': '22:16', '香蜜湖站': '22:19',
                '车公庙站': '22:21', '竹子林站': '22:24', '侨城东站': '22:25', '华侨城站': '22:27', '世界之窗站': '22:30',
                '白石洲': '22:31', '高新园': '22:34', '深圳大学': '22:36', '桃园': '22:39', '大新': '22:40',
                '鲤鱼门': '22:43', '前海湾': '22:45', '新安': '22:47', '宝安中心': '22:49', '宝体': '22:51',
                '坪洲': '22:53', '西乡': '22:55', '固戍': '22:59', '后瑞': '23:03', '机场东': '23:06'}
    subway_1_can_change_line = {'老街': '22:03', '大剧院': '22:06', '会展中心站': '22:14', '购物公园': '22:16',
                                '世界之窗站': '22:30', '前海湾': '22:45', '宝安中心': '22:49'}  # 7个

    subway_2 = {'赤湾': '22:00', '蛇口港': '22:02', '海上世界': '22:04', '水湾': '22:06', '东角头': '22:09',
                '湾厦': '22:11', '海月': '22:15', '登良': '22:16', '后海': '22:18', '科苑': '22:20',
                '红树湾': '22:23', '世界之窗站': '22:26', '侨城北': '22:29', '深康': '22:31', '安托山': '22:33',
                '侨香': '22:35', '香蜜': '22:37', '香梅北': '22:39', '景田': '22:41', '莲花西': '22:44',
                '福田': '22:46', '市民中心': '22:48', '岗厦北': '22:49', '华强北': '22:52', '燕南': '22:54',
                '大剧院': '22:56', '湖贝': '23:00', '黄贝岭': '23:02', '新秀站': '23:04'}
    subway_2_can_change_line = {'世界之窗站': '22:26', '福田': '22:46', '市民中心': '22:48',
                                '大剧院': '22:56', '黄贝岭': '23:02'}  # 5个

    subway_3 = {'益田': '22:00', '石厦': '22:02', '购物公园': '22:04', '福田': '22:06', '少年宫': '22:08',
                '莲花村': '22:10', '华新': '22:13', '通新岭': '22:15', '红岭': '22:17', '老街': '22:20',
                '晒布': '22:22', '翠竹': '22:24', '田贝': '22:27', '水贝': '22:29', '草埔': '22:32',
                '布吉': '22:35', '木棉湾': '22:37', '大芬': '22:40', '丹竹头': '22:42', '六约': '22:46',
                '塘坑': '22:49', '横岗': '22:52', '永湖': '22:54', '荷坳': '22:57', '大运': '22:59',
                '爱联': '23:01', '吉祥': '23:04', '龙城广场': '23:06', '南联': '23:08', '双龙': '23:10'}
    subway_3_can_change_line = {'购物公园': '22:04', '福田': '22:06', '少年宫': '22:08',
                                '老街': '22:20', '布吉': '22:35'}  # 5个

    subway_4 = {'清湖': '22:00', '龙华': '22:03', '龙胜': '22:05', '上塘': '22:07', '红山': '22:10',
                '深圳北': '22:12', '白石龙': '22:15', '民乐': '22:17', '上梅林': '22:20', '莲花北': '22:22',
                '少年宫': '22:24', '市民中心': '22:26', '会展中心站': '22:27', '福民': '22:29', '福田口岸': '22:31'}
    subway_4_can_change_line = {'深圳北': '22:12', '少年宫': '22:24', '市民中心': '22:26',
                                '会展中心站': '22:27'}
    subway_5 = {'黄贝岭': '22:03', '怡景': '22:05', '太安': '22:08', '布心': '22:10', '百鸽笼': '22:13',
                '布吉': '22:15', '长龙': '22:17', '下水径': '22:19', '上水径': '22:21', '杨美': '22:25',
                '坂田': '22:27', '五和': '22:30', '民治': '22:33', '深圳北': '22:35', '长岭陂': '22:39',
                '塘朗': '22:41', '大学城': '22:46', '西丽': '22:48', '留仙洞': '22:50', '兴东': '22:53',
                '洪浪北': '22:55', '灵芝': '22:57', '翻身': '23:00', '宝安中心': '23:02', '宝华': '23:03',
                '临海': '23:05', '前海湾': '23:07'}

    subway_5_can_change_line = {'黄贝岭': '22:03', '布吉': '22:15', '深圳北': '22:35', '宝安中心': '23:02', '前海湾': '23:07'}

    station_to_ind = {'后海': 0, '塘坑': 1, '世界之窗站': 2, '太安': 3, '竹子林站': 4, '深圳大学': 5,
                      '西乡': 6, '长岭陂': 7, '海月': 8, '市民中心': 9, '双龙': 10, '上塘': 11,
                      '新安': 12, '布吉': 13, '坂田': 14, '燕南': 15, '会展中心站': 16,
                      '老街': 17, '石厦': 18, '田贝': 19, '西丽': 20, '南联': 21,
                      '灵芝': 22, '前海湾': 23, '高新园': 24, '华侨城站': 25, '科学馆站': 26,
                      '侨香': 27, '爱联': 28, '上水径': 29, '白石洲': 30, '红山': 31,
                      '黄贝岭': 32, '白石龙': 33, '布心': 34, '车公庙站': 35, '购物公园': 36, '购物公园站': 36,
                      '清湖': 37, '华新': 38, '香蜜湖站': 39, '木棉湾': 40, '赤湾': 41,
                      '莲花村': 42, '百鸽笼': 43, '塘朗': 44, '民治': 45, '坪洲': 46,
                      '大学城': 47, '景田': 48, '福田口岸': 49, '留仙洞': 50, '怡景': 51,
                      '后瑞': 52, '岗厦站': 53, '湾厦': 54, '侨城东站': 55, '龙城广场': 56,
                      '宝体': 57, '大芬': 58, '华强路站': 59, '六约': 60, '香蜜': 61,
                      '杨美': 62, '少年宫': 63, '横岗': 64, '福民': 65, '翻身': 66,
                      '大剧院': 67, '大剧院站': 67, '红岭': 68, '海上世界': 69, '水湾': 70, '登良': 71,
                      '红树湾': 72, '通新岭': 73, '东角头': 74, '科苑': 75, '香梅北': 76,
                      '龙华': 77, '桃园': 78, '机场东': 79, '兴东': 80, '湖贝': 81,
                      '晒布': 82, '下水径': 83, '草埔': 84, '罗湖站': 85, '永湖': 86,
                      '福田': 87, '华强北': 88, '鲤鱼门': 89, '长龙': 90, '荷坳': 91,
                      '临海': 92, '国贸站': 93, '宝安中心': 94, '翠竹': 95, '洪浪北': 96,
                      '固戍': 97, '五和': 98, '龙胜': 99, '深圳北': 100, '深圳北站': 100, '大新': 101,
                      '新秀站': 102, '民乐': 103, '水贝': 104, '安托山': 105, '蛇口港': 106,
                      '吉祥': 107, '岗厦北': 108, '上梅林': 109, '大运': 110, '莲花西': 111,
                      '丹竹头': 112, '益田': 113, '莲花北': 114, '深康': 115, '侨城北': 116, '宝华': 117}

    int_station = {0: '后海', 1: '塘坑', 2: '世界之窗站', 3: '太安', 4: '竹子林站', 5: '深圳大学',
                   6: '西乡', 7: '长岭陂', 8: '海月', 9: '市民中心', 10: '双龙', 11: '上塘', 12: '新安',
                   13: '布吉', 14: '坂田', 15: '燕南', 16: '会展中心站', 17: '老街', 18: '石厦',
                   19: '田贝', 20: '西丽', 21: '南联', 22: '灵芝', 23: '前海湾', 24: '高新园',
                   25: '华侨城站', 26: '科学馆站', 27: '侨香', 28: '爱联', 29: '上水径',
                   30: '白石洲', 31: '红山', 32: '黄贝岭', 33: '白石龙', 34: '布心',
                   35: '车公庙站', 36: '购物公园', 37: '清湖', 38: '华新', 39: '香蜜湖站',
                   40: '木棉湾', 41: '赤湾', 42: '莲花村', 43: '百鸽笼', 44: '塘朗',
                   45: '民治', 46: '坪洲', 47: '大学城', 48: '景田', 49: '福田口岸',
                   50: '留仙洞', 51: '怡景', 52: '后瑞', 53: '岗厦站', 54: '湾厦',
                   55: '侨城东站', 56: '龙城广场', 57: '宝体', 58: '大芬', 59: '华强路站',
                   60: '六约', 61: '香蜜', 62: '杨美', 63: '少年宫', 64: '横岗', 65: '福民',
                   66: '翻身', 67: '大剧院', 68: '红岭', 69: '海上世界', 70: '水湾', 71: '登良',
                   72: '红树湾', 73: '通新岭', 74: '东角头', 75: '科苑', 76: '香梅北', 77: '龙华',
                   78: '桃园', 79: '机场东', 80: '兴东', 81: '湖贝', 82: '晒布', 83: '下水径',
                   84: '草埔', 85: '罗湖站', 86: '永湖', 87: '福田', 88: '华强北', 89: '鲤鱼门',
                   90: '长龙', 91: '荷坳', 92: '临海', 93: '国贸站', 94: '宝安中心', 95: '翠竹',
                   96: '洪浪北', 97: '固戍', 98: '五和', 99: '龙胜', 100: '深圳北', 101: '大新',
                   102: '新秀站', 103: '民乐', 104: '水贝', 105: '安托山', 106: '蛇口港',
                   107: '吉祥', 108: '岗厦北', 109: '上梅林', 110: '大运', 111: '莲花西',
                   112: '丹竹头', 113: '益田', 114: '莲花北', 115: '深康', 116: '侨城北', 117: '宝华'}


def cal_two_station_time(station1, station2):
    change_station = [Subway.subway_1_can_change_line, Subway.subway_2_can_change_line, Subway.subway_3_can_change_line,
                      Subway.subway_4_can_change_line, Subway.subway_5_can_change_line]
    all_subway = [Subway.subway_1, Subway.subway_2, Subway.subway_3, Subway.subway_4, Subway.subway_5]
    # 分两种情况, 两地点在同一条线
    for i, sub in enumerate(all_subway):
        if station1 in sub and station2 in sub:
            station1_time = datetime.datetime.strptime(sub[station1], "%H:%M")
            station2_time = datetime.datetime.strptime(sub[station2], "%H:%M")
            if station1_time > station2_time:
                return station1_time - station2_time
            else:
                return station2_time - station1_time
    station1_can_change_line = []
    station2_can_change_line = []
    common_station = []
    # 分两种情况,两地点不在同一条线
    for i, subway in enumerate(all_subway):
        if subway.__contains__(station1):
            station1_can_change_line.append(i)  # 该站点是多条地铁线的点
            # print(station1, "在", i+1, "号线")
        if subway.__contains__(station2):
            station2_can_change_line.append(i)
            # print(station2, "在", i + 1, "号线")
    for i in station1_can_change_line:
        for j in station2_can_change_line:
            common = list(change_station[i].keys() & change_station[j].keys())
            for c in common:
                common_station.append(c)

    # print("两条地铁线可转线的站点:", common_station)
    two_station_time = []
    if len(common_station) >= 1:
        for c in common_station:
            two_station_time.append(str(cal_two_station_time(station1, c) + cal_two_station_time(station2, c)))
        return min(two_station_time)


def time_to_minute(str_time):
    # str_time 格式 H:M:00 函数的作用的是将'1:12:00'-->转为60+12=72分钟
    hour, minute, second = str_time.split(":")
    return int(hour)*60 + int(minute)


def matrix_two_station_time():
    # 函数的作用是计算两个地点之间的达到时间 118x118的矩阵
    matrix_time = np.zeros((118, 118))
    station = Subway.int_station
    for i in range(118):
        for j in range(118):
            matrix_time[i, j] = time_to_minute(str(cal_two_station_time(station[i], station[j])))

    return matrix_time

matrix_time = matrix_two_station_time()

def cal_can_arrive(station1, start_time, end_time):
    start_time = datetime.datetime.strptime(start_time, "%H:%M")
    end_time = datetime.datetime.strptime(end_time, "%H:%M")
    minus_time = time_to_minute(str(end_time - start_time))  # 多少分钟

    station1_id = Subway.station_to_ind[station1]  # 找到id
    station1_can = matrix_time[station1_id][:]
    can_arrive_point_id = []
    for i in range(len(station1_can)):
        if station1_can[i] <= minus_time:
            can_arrive_point_id.append(i)
    can_arrive_point = []
    for point in can_arrive_point_id:
        can_arrive_point.append(Subway.int_station[point])
    # print('1',station1,start_time,end_time)
    # print(can_arrive_point)
    # can_arrive_point.remove(station1)
    return can_arrive_point


def main():
    print(cal_can_arrive("购物公园站", "11:07", "11:07"))
    # print(cal_can_arrive("购物公园", "11:07", "12:30"))
if __name__ == '__main__':
    # main()
    A=[0.10235, 0.09689, 0.09468, 0.09625]  #h=394
    B=[0.09379, 0.09174, 0.08836, 0.08874]
    C=[0.06173, 0.05983, 0.05951, 0.05924]
    D=[0.04308, 0.04114, 0.04033, 0.03853]
    E=[0.03105, 0.02854, 0.02821, 0.02769]
    for a,b,c,d,e in zip(A,B,C,D,E):
        print([a,b,c,d,e])


